In [1]:
import pandas as pd
array = [2,4,6,8,10,12]
series_obj = pd.Series(array)
arr = series_obj.values
arr

array([ 2,  4,  6,  8, 10, 12])

In [2]:
reshaped_arr = arr.reshape((3,2))
reshaped_arr

array([[ 2,  4],
       [ 6,  8],
       [10, 12]])

In [3]:
import pandas as pd
array = ['ankit','shaurya','shivangi','shetty','Ken','Adam']
series_obj = pd.Series(array)
print("Given Seies :\n",series_obj)
arr = series_obj.values
arr

Given Seies :
 0       ankit
1     shaurya
2    shivangi
3      shetty
4         Ken
5        Adam
dtype: object

array(['ankit', 'shaurya', 'shivangi', 'shetty', 'Ken', 'Adam'],
      dtype=object)

In [4]:
reshaped_arr = arr.reshape((2,3))
print("After Reshaping : \n",reshaped_arr)

After Reshaping :
 [['ankit' 'shaurya' 'shivangi']
 ['shetty' 'Ken' 'Adam']]

In [5]:
import pandas as pd
df = pd.DataFrame({'A':['John','Bob','Marcy'],
                  'B':['Masters','Graduate','Phd'],
                  'C':[24,56,12]})
df

       A         B   C
0   John   Masters  24
1    Bob  Graduate  56
2  Marcy       Phd  12

In [6]:
df.pivot('A','B','C')

B      Graduate  Masters   Phd
A
Bob        56.0      NaN   NaN
John        NaN     24.0   NaN
Marcy       NaN      NaN  12.0

In [8]:
df.pivot(index ='A',columns='B',values=['C','A'])

             C                     A
B     Graduate Masters  Phd Graduate Masters    Phd
A
Bob         56     NaN  NaN      Bob     NaN    NaN
John       NaN      24  NaN      NaN    John    NaN
Marcy      NaN     NaN   12      NaN     NaN  Marcy

In [12]:
import pandas as pd
df = pd.DataFrame({'Name':['John','Sammy','Stephen','Joe','Emily','Tom'],
                  'Gender':['Male','Female','Male','Female','Female','Male'],
                  'Age':[45,6,4,36,12,43]})
print("Dataset")
print(df)
print("-"*40)
def age_bucket(age):
    if age <=18:
        return "<18"
    else:
        return ">18"
df['Age Group']=df['Age'].apply(age_bucket)
gender=pd.DataFrame(df.Gender.value_counts(normalize=True)*100).reset_index()
gender.columns = ['Gender','%Gender']
df = pd.merge(left=df,right=gender,how='inner',on=['Gender'])
table = pd.pivot_table(df,index=['Gender','%Gender','Age Group'],
                      values=['Name'],aggfunc={'Name':'count'})
print("Table")
print(table)

Dataset
      Name  Gender  Age
0     John    Male   45
1    Sammy  Female    6
2  Stephen    Male    4
3      Joe  Female   36
4    Emily  Female   12
5      Tom    Male   43
----------------------------------------
Table
                          Name
Gender %Gender Age Group
Female 50.0    <18           2
               >18           1
Male   50.0    <18           1
               >18           2